УТ_для_edt/src/InformationRegisters/смартВыведенныеИзОборотаТовары/смартВыведенныеИзОборотаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартВыведенныеИзОборотаТовары</name>
  <comment>//++ #1686 смарт: Мосолов 18.03.2024 // Создать механизм ручного резервирования товаров (временного вывода из оборота)</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаВозникновения</name>
    <comment>//++ #Б-1384 смарт: Мосолов 18.11.2024 //Добавить в форму &quot;Выведенные из оборота товары (смарт)&quot; две колонки</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХодВосстановления</name>
    <comment>//++ #Б-1384 смарт: Мосолов 18.11.2024 //Добавить в форму &quot;Выведенные из оборота товары (смарт)&quot; две колонки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаВыводаИзОборота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КорректировкаРегистров</name>
    <type>
      <types>DocumentRef.КорректировкаРегистров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОтгрузки</name>
    <type>
      <types>DefinedType.РаспоряжениеНаОтгрузку</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Documents/СписаниеНедостачТоваров/СписаниеНедостачТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеНедостачТоваров</name>
  <basedOn>Document.ОрдерНаОтражениеНедостачТоваров</basedOn>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <registerRecords>AccumulationRegister.РезервыТоваровОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.смартСвободныеОстаткиОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОформлениюИзлишковНедостач</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияНоменклатураДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ПартииПрочихРасходов</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.смартТоварыНаСкладахОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ПартииНДСКРаспределению</registerRecords>
  <registerRecords>AccumulationRegister.ДетализацияПартийТоваровДляНДСиУСН</registerRecords>
  <registerRecords>AccumulationRegister.НДСПредъявленный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОформлениюОтчетовКомитенту</registerRecords>
  <registerRecords>AccumulationRegister.ПартииРасходовНаСебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ОбеспечениеЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ДетализацияПартийТоваровДляНДСиУСН2_4</registerRecords>
  <registerRecords>AccumulationRegister.НДСЗаписиКнигиПродаж</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыОрганизацийКПередаче</registerRecords>
  <registerRecords>AccumulationRegister.СвободныеОстатки</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.НДСЗаписиКнигиПокупок</registerRecords>
  <registerRecords>AccumulationRegister.ПартииЗатратНаВыпуск</registerRecords>
  <attributes>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникИнформацииОЦенахДляПечати</name>
    <type>
      <types>EnumRef.ИсточникиИнформацииОЦенахДляПечати</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидыЗапасовУказаныВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПересчетТоваров</name>
    <type>
      <types>DocumentRef.ПересчетТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.СверкаНачальныхОстатковПоСкладу</types>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивов</name>
    <type>
      <types>Characteristic.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Субконто1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Субконто2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Субконто3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельностиНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЕстьАлкогольнаяПродукцияДляСписанияЕГАИС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартЗапчастиГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаУчетаНоменклатуры</name>
      <type>
        <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыЗапасов</name>
    <attributes>
      <name>АналитикаУчетаНоменклатуры</name>
      <type>
        <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗапасов</name>
      <type>
        <types>CatalogRef.ВидыЗапасов</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоРНПТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>23</precision>
          <scale>11</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/InformationRegisters/смартВыведенныеИзОборотаТовары/Forms/ФормаВыводаТоваровИзОборота/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    УстановитьПривилегированныйРежим(Истина);
	
	Параметры.Свойство("Ключ", Корректировка);
	
	Попытка
		
		ЗаблокироватьДанныеДляРедактирования(Корректировка,, УникальныйИдентификатор);  
		
	Исключение
		
		Сообщение = Новый СообщениеПользователю;  
		
		ТекстОшибки = ОписаниеОшибки();
		ПозицияНачала = СтрНайти(ТекстОшибки, "Объект уже заблокирован"); 
		
		Сообщение.Текст = Сред(ТекстОшибки, ПозицияНачала);
		Сообщение.Сообщить();
		
		ВызватьИсключение;
		
	КонецПопытки;   
	
	АвтоЗаголовок = Ложь;
	Заголовок = "Изменение товаров, выведенных из оборота";
	
	ЗаполнитьТовары();
	
	//++ #Б4402 смарт: Шляпников 18.09.2025 / Ошибка ЖР. Вывод товаров из оборота. 
	Для каждого стрТовары Из Товары Цикл
		
		ПараметрыУказанияСерий = ПолучитьПараметрыУказанияСерийДляРасчета(стрТовары.Склад);
		
		РезультатРасчета = НоменклатураСервер.ПроверитьСериюРассчитатьСтатусПриИзмененииРеквизитаВТЧ(
									стрТовары,
									стрТовары.Склад,
									ПараметрыУказанияСерий); 
									
	    стрТовары.СтатусУказанияСерий = РезультатРасчета.СтатусУказанияСерий;
		
	КонецЦикла;
	//-- #Б4402 смарт: Шляпников 18.09.2025

    УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ПриЗакрытииНаСервере();  
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	
	Если Модифицированность Тогда 
		
		СтандартнаяОбработка = Ложь; 
		Отказ = Истина;
		Ответ = Неопределено; 
		Модифицированность = Ложь;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ОтветНаВопросОСохраненииЗавершение", ЭтаФорма), 
						"Данные изменены. Сохранить?", 
						РежимДиалогаВопрос.ДаНет);
						
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	РазблокироватьДанныеДляРедактирования(Корректировка, УникальныйИдентификатор); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопросОСохраненииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗафиксироватьИзмененияНаСервере();
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТовары() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Склад КАК Склад,
	|	Номенклатура КАК Номенклатура,
	|	Характеристика КАК Характеристика,
	|	Серия КАК Серия,
	|	ПричинаВыводаИзОборота КАК ПричинаВыводаИзОборота,
	|	ДокументОтгрузки КАК ДокументОтгрузки,  
	
	//++ #Б-1384 смарт: Мосолов 18.11.2024 //Добавить в форму "Выведенные из оборота товары (смарт)" две колонки
	|	ДатаВозникновения КАК ДатаВозникновения,  
	|	ХодВосстановления КАК ХодВосстановления,  
	//-- #Б-1384 смарт: Мосолов 18.11.2024   
	
	|	Количество КАК Количество
	|ИЗ
	|	РегистрСведений.смартВыведенныеИзОборотаТовары КАК смартВыведенныеИзОборотаТовары
	|
	|УПОРЯДОЧИТЬ ПО
	|	Склад.Наименование,
	|	Номенклатура.Наименование";	
	
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСерияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;  
	
	ОткрытьПодборСерий(Элемент.ТекстРедактирования);  
	
КонецПроцедуры    

&НаКлиенте
Процедура ОткрытьПодборСерий(Текст = "", ТекущиеДанные = Неопределено)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	ПараметрыУказанияСерий = ПолучитьПараметрыУказанияСерий(ТекущиеДанные.Склад);
	
	Если НоменклатураКлиент.ДляУказанияСерийНуженСерверныйВызов(ЭтаФорма, ПараметрыУказанияСерий, Текст, ТекущиеДанные)Тогда
		ТекстИсключения = НСтр("ru = 'Ошибка при попытке указать серии - в этом документе для указания серий не нужен серверный вызов.'");
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Функция ПолучитьПараметрыУказанияСерий(Склад) Экспорт
	
	ПараметрыУказанияСерий = НоменклатураКлиентСервер.ПараметрыУказанияСерий();
	
	ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.РеализацияТоваровУслуг";
	
	ПараметрыСерийСклада = СкладыСервер.ИспользованиеСерийНаСкладе(Склад, Ложь);
	
	ПараметрыУказанияСерий.ИмяТЧСерии = "Товары";
	ПараметрыУказанияСерий.ИмяТЧТовары = "Товары";
	ПараметрыУказанияСерий.УчитыватьСебестоимостьПоСериям = ПараметрыСерийСклада.УчитыватьСебестоимостьПоСериям;
	ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры  = ПараметрыСерийСклада.ИспользоватьСерииНоменклатуры;
	ПараметрыУказанияСерий.ПоляСвязи.Добавить("Склад");
	
	ПараметрыУказанияСерий.СкладскиеОперации.Добавить(Перечисления.СкладскиеОперации.ПустаяСсылка());
	
	ПараметрыУказанияСерий.ЭтоНакладная = Истина;            
	
	ПараметрыУказанияСерий.ТолькоСерииДляСебестоимости = Истина;
	ПараметрыУказанияСерий.Дата = Корректировка.Дата;
	
	ПараметрыУказанияСерий.Вставить("ЭтоВыводИзОборота", Истина);
	
	Возврат ПараметрыУказанияСерий; 
	
КонецФункции

&НаСервере
Функция ПолучитьПараметрыУказанияСерийДляРасчета(Склад) Экспорт
	
	ПараметрыУказанияСерий = НоменклатураКлиентСервер.ПараметрыУказанияСерий();
	
	ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.СписаниеНедостачТоваров";
	
	ПараметрыСерийСклада = СкладыСервер.ИспользованиеСерийНаСкладе(Склад, Ложь);
	
	ПараметрыУказанияСерий.ИмяТЧСерии = "Товары";
	ПараметрыУказанияСерий.ИмяТЧТовары = "Товары";
	ПараметрыУказанияСерий.УчитыватьСебестоимостьПоСериям = ПараметрыСерийСклада.УчитыватьСебестоимостьПоСериям;
	ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры  = ПараметрыСерийСклада.ИспользоватьСерииНоменклатуры;
	ПараметрыУказанияСерий.ПоляСвязи.Добавить("Назначение");
	
	ПараметрыУказанияСерий.СкладскиеОперации.Добавить(Перечисления.СкладскиеОперации.ПустаяСсылка());
	
	ПараметрыУказанияСерий.ЭтоНакладная = Истина;            
	
	ПараметрыУказанияСерий.ТолькоСерииДляСебестоимости = Истина;
	ПараметрыУказанияСерий.Дата = Корректировка.Дата;
	
	Возврат ПараметрыУказанияСерий; 
	
КонецФункции

&НаКлиенте
Процедура ТоварыСерияПриИзменении(Элемент)    
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	ВыбранноеЗначение = НоменклатураКлиентСервер.ВыбраннаяСерия();
	ПараметрыУказанияСерий = ПолучитьПараметрыУказанияСерий(ТекущиеДанные.Склад);
	
	ВыбранноеЗначение.Значение            		 = Элементы.Товары.ТекущиеДанные.Серия;
	ВыбранноеЗначение.ИдентификаторТекущейСтроки = Элементы.Товары.ТекущиеДанные.ПолучитьИдентификатор();
	
	НоменклатураКлиент.ОбработатьУказаниеСерии(ЭтаФорма, ПараметрыУказанияСерий, ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	УстановитьСтатусУказанияСерийИспользованиеХарактеристик(ТекущаяСтрока);
	
КонецПроцедуры   

&НаКлиенте
Процедура ТоварыСкладПриИзменении(Элемент) 
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные; 
	УстановитьСтатусУказанияСерийИспользованиеХарактеристик(ТекущаяСтрока);  
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусУказанияСерийИспользованиеХарактеристик(ТекущаяСтрока)
	
	ПараметрыУказанияСерий = ПолучитьПараметрыУказанияСерийДляРасчета(ТекущаяСтрока.Склад);
	
	ПолучитьРезультатСтатусаСерий(ПараметрыУказанияСерий);
	
КонецПроцедуры   

&НаСервере
Функция ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(Склад) Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Склад",       Склад);
	СтруктураПараметров.Вставить("СкладГруппа", Ложь);
	
	Возврат СтруктураПараметров;
	
КонецФункции    

&НаСервере
Функция ПолучитьРезультатСтатусаСерий(ПараметрыУказанияСерий) 
	
	ИдентификаторСтроки = Элементы.Товары.ТекущаяСтрока;
	ТекущиеДанные = Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	РезультатРасчета = НоменклатураСервер.ПроверитьСериюРассчитатьСтатусПриИзмененииРеквизитаВТЧ(
								ТекущиеДанные,
								ТекущиеДанные.Склад,
								ПараметрыУказанияСерий); 
								
    ЗаполнитьЗначенияСвойств(ТекущиеДанные, РезультатРасчета);

КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыборСерииВВыводИзОборота" Тогда 
		
		Если Параметр.Свойство("ИдентификаторТекущейСтроки") И Параметр.Свойство("Значение") Тогда 
			
			ТекущиеДанные = Товары.НайтиПоИдентификатору(Параметр.ИдентификаторТекущейСтроки); 
			
			Если НЕ ТекущиеДанные = Неопределено Тогда 
			
				ТекущиеДанные.Серия = Параметр.Значение;   
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗафиксироватьИзмененияНаСервере()    
	
	УстановитьПривилегированныйРежим(Истина);
	
	КорректировкаОбъект = Корректировка.ПолучитьОбъект();
	
	КорректировкаОбъект.Движения.ТоварыКОтгрузке.Очистить();
	КорректировкаОбъект.Движения.СвободныеОстатки.Очистить();  
	
	НаборЗаписей = РегистрыСведений.смартВыведенныеИзОборотаТовары.СоздатьНаборЗаписей();
	
	Для Каждого СтрокаТоваров Из Товары Цикл
		
		Запись = НаборЗаписей.Добавить(); 
		ЗаполнитьЗначенияСвойств(Запись, СтрокаТоваров);
		Запись.КорректировкаРегистров = Корректировка;
		Запись.ДокументОтгрузки = Корректировка;
		
		//++ #Б-1384 смарт: Мосолов 18.11.2024 //Добавить в форму "Выведенные из оборота товары (смарт)" две колонки
		Запись.ДатаВозникновения = ?(ЗначениеЗаполнено(СтрокаТоваров.ДатаВозникновения), 
			СтрокаТоваров.ДатаВозникновения,
			ТекущаяДата()); 
		//-- #Б-1384 смарт: Мосолов 18.11.2024   
		
		Запись = КорректировкаОбъект.Движения.ТоварыКОтгрузке.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, СтрокаТоваров); 
		Запись.Активность = Истина; 
		Запись.Период = ТекущаяДата();
		Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
		Запись.Регистратор = Корректировка;
		Запись.ДокументОтгрузки = Корректировка;
		Запись.ВРезерве = СтрокаТоваров.Количество; 
		
		Запись = КорректировкаОбъект.Движения.СвободныеОстатки.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, СтрокаТоваров); 
		Запись.Активность = Истина;
		Запись.Период = ТекущаяДата();
		Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
		Запись.Регистратор = Корректировка;
		Запись.ВРезервеСоСклада = СтрокаТоваров.Количество;
		
	КонецЦикла;
	
	КорректировкаОбъект.Записать();
	
	КорректировкаОбъект.Движения.ТоварыКОтгрузке.Записать();
	КорректировкаОбъект.Движения.СвободныеОстатки.Записать();
	НаборЗаписей.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗафиксироватьИзменения(Команда)
	
	Модифицированность = Ложь;
	ЗафиксироватьИзмененияНаСервере(); 
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	Модифицированность = Истина; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодбор(Команда)   
	
	ПараметрЗаголовок = НСтр("ru = 'Подбор товаров в вывод товаров из оборота'");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВозвращатьМногооборотнуюТару", Ложь);
	ПараметрыФормы.Вставить("СкрыватьРучныеСкидки", Истина);
	ПараметрыФормы.Вставить("РежимПодбораИспользоватьСкладыВТабличнойЧасти", Истина);
	ПараметрыФормы.Вставить("ИспользоватьДатыОтгрузки",                      Истина);
	ПараметрыФормы.Вставить("Валюта",                                  ВернутьВалютуУправленческогоУчета());
	ПараметрыФормы.Вставить("Заголовок",                               ПараметрЗаголовок);
	ПараметрыФормы.Вставить("Дата",                                    ТекущаяДата());
	ПараметрыФормы.Вставить("Документ",                                Корректировка);
	ПараметрыФормы.Вставить("ПараметрыУказанияСерий",                  ПолучитьПараметрыУказанияСерий(ПредопределенноеЗначение("Справочник.Склады.ПустаяСсылка")));
    
    ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор); 
	
КонецПроцедуры  

&НаСервере
Функция ВернутьВалютуУправленческогоУчета()

	Возврат Константы.ВалютаУправленческогоУчета.Получить();
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Обработка.ПодборТоваровВДокументПродажи.Форма.Форма" Тогда
		
		ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение); 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)
	
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);

	Для каждого СтрокаТовара Из ТаблицаТоваров Цикл
		
		ТекущаяСтрока = Товары.Добавить(); 
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтрокаТовара, "Номенклатура, Характеристика, Склад, Серия");
		ТекущаяСтрока.Количество = СтрокаТовара.КоличествоУпаковок;
		
	КонецЦикла;
	
КонецПроцедуры
	
#КонецОбласти
